# 04 - Grouping

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [2]:
users = pd.read_table('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', 
                      sep='|', index_col='user_id')
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Step 4. Discover what is the mean age per occupation

In [4]:
occ = users.groupby("occupation")
occ = occ.mean()
occ

                     age
occupation
administrator  38.746835
artist         31.392857
doctor         43.571429
educator       42.010526
engineer       36.388060
entertainment  29.222222
executive      38.718750
healthcare     41.562500
homemaker      32.571429
lawyer         36.750000
librarian      40.000000
marketing      37.615385
none           26.555556
other          34.523810
programmer     33.121212
retired        63.071429
salesman       35.666667
scientist      35.548387
student        22.081633
technician     33.148148
writer         36.311111

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [18]:
#users.groupby("occupation").size()

#df2 = users.groupby(['occupation', 'gender']).size().reset_index(name='count') 
#print(df2)
df3 = users.groupby(['occupation', 'gender']).size().unstack(fill_value=0)
df3["Ratio M"] = (df3["M"] /(df3["M"] + df3["F"]))
pd.options.display.float_format = "{:,.2%}".format
df3.sort_values(by=['Ratio M'], ascending=False, inplace=True)
df3

gender          F    M  Ratio M
occupation
doctor          0    7  100.00%
engineer        2   65   97.01%
technician      1   26   96.30%
retired         1   13   92.86%
programmer      6   60   90.91%
executive       3   29   90.62%
scientist       3   28   90.32%
entertainment   2   16   88.89%
lawyer          2   10   83.33%
salesman        3    9   75.00%
educator       26   69   72.63%
student        60  136   69.39%
other          36   69   65.71%
marketing      10   16   61.54%
writer         19   26   57.78%
none            4    5   55.56%
administrator  36   43   54.43%
artist         13   15   53.57%
librarian      29   22   43.14%
healthcare     11    5   31.25%
homemaker       6    1   14.29%

### Step 6. For each occupation, calculate the minimum and maximum ages

In [28]:
result = users.groupby('occupation').agg({'age': ['min', 'max']})
result

#ages = users.groupby("occupation")
#agemin = ages.min()
#agemin

              age
              min max
occupation
administrator  21  70
artist         19  48
doctor         28  64
educator       23  63
engineer       22  70
entertainment  15  50
executive      22  69
healthcare     22  62
homemaker      20  50
lawyer         21  53
librarian      23  69
marketing      24  55
none           11  55
other          13  64
programmer     20  63
retired        51  73
salesman       18  66
scientist      23  55
student         7  42
technician     21  55
writer         18  60

### Step 7. For each combination of occupation and gender, calculate the mean age

In [35]:
bygender = users.groupby(['occupation', 'gender']).agg({'age': ['mean']})
pd.options.display.float_format = "{:,.1f}".format
bygender

                      age
                     mean
occupation    gender
administrator F      40.6
              M      37.2
artist        F      30.3
              M      32.3
doctor        M      43.6
educator      F      39.1
              M      43.1
engineer      F      29.5
              M      36.6
entertainment F      31.0
              M      29.0
executive     F      44.0
              M      38.2
healthcare    F      39.8
              M      45.4
homemaker     F      34.2
              M      23.0
lawyer        F      39.5
              M      36.2
librarian     F      40.0
              M      40.0
marketing     F      37.2
              M      37.9
none          F      36.5
              M      18.6
other         F      35.5
              M      34.0
programmer    F      32.2
              M      33.2
retired       F      70.0
              M      62.5
salesman      F      27.0
              M      38.6
scientist     F      28.3
              M      36.3
student       F      20.8
              M      22.7
technician    F      38.0
              M      33.0
writer        F      37.6
              M      35.3

### Step 8.  For each occupation present the percentage of women and men

In [43]:
fhh = users.groupby(['occupation', 'gender']).size().unstack(fill_value=0)
fhh["F%"] = (df3["F"] /(df3["M"] + df3["F"]))
fhh["M%"] = (df3["M"] /(df3["M"] + df3["F"]))
pd.options.display.float_format = "{:,.2%}".format
fhh.drop(['F', 'M'], axis=1)

gender            F%      M%
occupation
administrator 45.57%  54.43%
artist        46.43%  53.57%
doctor         0.00% 100.00%
educator      27.37%  72.63%
engineer       2.99%  97.01%
entertainment 11.11%  88.89%
executive      9.38%  90.62%
healthcare    68.75%  31.25%
homemaker     85.71%  14.29%
lawyer        16.67%  83.33%
librarian     56.86%  43.14%
marketing     38.46%  61.54%
none          44.44%  55.56%
other         34.29%  65.71%
programmer     9.09%  90.91%
retired        7.14%  92.86%
salesman      25.00%  75.00%
scientist      9.68%  90.32%
student       30.61%  69.39%
technician     3.70%  96.30%
writer        42.22%  57.78%